data/new 38.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <application xmlns="http://sv.bpc.in/SVAP/iss">
            <application_number>APPL01098072</application_number>
            <application_type>APTPISSA</application_type>
            <application_flow_id>1001</application_flow_id>
            <application_status>APST0006</application_status>
            <operator_id>90132022</operator_id>
            <institution_id>1001</institution_id>
            <agent_id>70000010</agent_id>
            <customer_type>ENTTPERS</customer_type>
            <customer id="customer_1">
                <command>CMMDCRPR</command>
                <customer_number>1102953</customer_number>
                <customer_category>CCTGORDN</customer_category>
                <customer_relation>RSCBEXTR</customer_relation>
                <nationality>704</nationality>
                <employment_status>CSESEMPL</employment_status>
                <flexible_field>
                    <flexible_field_name>CST_CFC_COMPANY_NAME</flexible_field_name>
                    <flexible_field_value>null</flexible_field_value>
                </flexible_field>
                <flexible_field>
                    <flexible_field_name>CST_REFERENCE_NAME</flexible_field_name>
                    <flexible_field_value>pipie</flexible_field_value>
                </flexible_field>
                <flexible_field>
                    <flexible_field_name>CST_REFERENCE_RELATION</flexible_field_name>
                    <flexible_field_value>50025230</flexible_field_value>
                </flexible_field>
                <flexible_field>
                    <flexible_field_name>CST_REFERENCE_PHONE</flexible_field_name>
                    <flexible_field_value>0327618866</flexible_field_value>
                </flexible_field>
                <flexible_field>
                    <flexible_field_name>CST_ID_ISSUE_PLACE</flexible_field_name>
                    <flexible_field_value>Cục Cảnh Sát Đkql Và Dlqg</flexible_field_value>
                </flexible_field>
                <contract>
                    <command>CMMDCREX</command>
                    <contract_type>CNTPBANK</contract_type>
                    <product_id>60000142</product_id>
                    <card id="card_1">
                        <command>CMMDCRUP</command>
                        <card_type>8017</card_type>
                        <category>CRCG0800</category>
                        <card_delivery_channel>CRDC5003</card_delivery_channel>
                        <card_status>CSTS0018</card_status>
                        <cardholder>
                            <command>CMMDCRUP</command>
                            <cardholder_name>TRAN THI KIM THOA</cardholder_name>
                            <address>
                                <command>CMMDCRUP</command>
                                <address_type>ADTPBSNA</address_type>
                                <country>704</country>
                                <address_name language="LANGVNM">
                                    <region>..</region>
                                    <city>..</city>
                                    <street>..</street>
                                </address_name>
                                <postal_code>....</postal_code>
                                <region_code>....</region_code>
                            </address>
                            <sec_word>
                                <secret_question>SEQUWORD</secret_question>
                                <secret_answer>CCDE</secret_answer>
                            </sec_word>
                            <notification>
                                <command>CMMDCRUP</command>
                                <delivery_channel>3</delivery_channel>
                                <delivery_address>..</delivery_address>
                                <is_active>1</is_active>
                            </notification>
                        </cardholder>
                    </card>
                    <service value="70000018">
                        <service_object ref_id="account_1">
                            <attribute_char value="10002287">
                                <attribute_value_char>STDM5003</attribute_value_char>
                            </attribute_char>
                            <attribute_fee value="10000395">
                                <fee_rate_calc>FEEM0002</fee_rate_calc>
                                <fee_base_calc>FEEB0001</fee_base_calc>
                                <fee_fixed_value>20010000</fee_fixed_value>
                                <currency>704</currency>
                            </attribute_fee>
                            <attribute_cycle value="10000381">
                                <cycle_start_date>2025-09-05</cycle_start_date>
                                <cycle_length_type>LNGT0002</cycle_length_type>
                                <cycle_length>1</cycle_length>
                                <shift>
                                    <shift_type>CSHTMDAY</shift_type>
                                    <shift_priority>10</shift_priority>
                                    <shift_sign>1</shift_sign>
                                    <shift_length_type>LNGT0002</shift_length_type>
                                    <shift_length>2</shift_length>
                                </shift>
                                <shift>
                                    <shift_type>CSHTPERD</shift_type>
                                    <shift_priority>20</shift_priority>
                                    <shift_sign>-1</shift_sign>
                                    <shift_length_type>LNGT0002</shift_length_type>
                                    <shift_length>0</shift_length>
                                </shift>
                            </attribute_cycle>
                        </service_object>
                    </service>
                    <service value="70000001">
                        <service_object ref_id="account_1" />
                    </service>
                    <service value="70000002">
                        <service_object ref_id="card_1" />
                    </service>
                    <service value="70000003">
                        <service_object ref_id="card_1" />
                    </service>
                    <service value="70000008">
                        <service_object ref_id="customer_1" />
                    </service>
                    <service value="70000142">
                        <service_object ref_id="account_1" />
                    </service>
                    <account id="account_1">
                        <command>CMMDCRPR</command>
                        <currency>704</currency>
                        <account_type>ACTP0130</account_type>
                        <account_object ref_id="card_1">
                            <account_link_flag>1</account_link_flag>
                            <is_pos_default>1</is_pos_default>
                            <is_atm_default>1</is_atm_default>
                        </account_object>
                        <payment_order id="payment_order_1">
                            <command>CMMDCRUP</command>
                            <payment_purpose_id>70000001</payment_purpose_id>
                            <payment_date>2025-09-05</payment_date>
                            <is_payment_order_template>1</is_payment_order_template>
                            <payment_parameter id="payment_parameter_1">
                                <payment_parameter_name>CBS_TRANSFER_BANK_NAME</payment_parameter_name>
                                <payment_parameter_value>None</payment_parameter_value>
                            </payment_parameter>
                            <payment_parameter id="payment_parameter_2">
                                <payment_parameter_name>CBS_TRANSFER_BANK_BRANCH_NAME</payment_parameter_name>
                                <payment_parameter_value>None</payment_parameter_value>
                            </payment_parameter>
                            <payment_parameter id="payment_parameter_3">
                                <payment_parameter_name>CBS_TRANSFER_RECIPIENT_ACCOUNT</payment_parameter_name>
                                <payment_parameter_value>None</payment_parameter_value>
                            </payment_parameter>
                            <payment_parameter id="payment_parameter_4">
                                <payment_parameter_name>CARDHOLDER_NAME</payment_parameter_name>
                                <payment_parameter_value>TRAN THI KIM THOA</payment_parameter_value>
                            </payment_parameter>
                        </payment_order>
                        <flexible_field>
                            <flexible_field_name>CST_MAD_PAY_TYPE</flexible_field_name>
                            <flexible_field_value>None</flexible_field_value>
                        </flexible_field>
                        <flexible_field>
                            <flexible_field_name>CST_DIRECT_DEBIT_DATE</flexible_field_name>
                            <flexible_field_value>2025-10-01</flexible_field_value>
                        </flexible_field>
                    </account>
                </contract>
                <person>
                    <command>CMMDCRUP</command>
                    <person_name language="LANGENG">
                        <surname>TRẦN THỊ KIM</surname>
                        <first_name>THOA</first_name>
                    </person_name>
                    <birthday>1999-06-01</birthday>
                    <gender>GNDRFEML</gender>
                    <identity_card>
                        <command>CMMDCRUP</command>
                        <id_type>IDTP0045</id_type>
                    </identity_card>
                </person>
                <contact>
                    <command>CMMDCRUP</command>
                    <contact_type>CNTTPRMC</contact_type>
                    <preferred_lang>LANGENG</preferred_lang>
                    <contact_data>
                        <commun_method>CMNM0001</commun_method>
                        <commun_address>""</commun_address>
                    </contact_data>
                    <contact_data>
                        <commun_method>CMNM0002</commun_method>
                        <commun_address>bnpl_tts@vietcredit.com.vn</commun_address>
                    </contact_data>
                </contact>
                <contact>
                    <command>CMMDCRUP</command>
                    <contact_type>CNTTNTFC</contact_type>
                    <preferred_lang>LANGENG</preferred_lang>
                    <contact_data>
                        <commun_method>CMNM0001</commun_method>
                        <commun_address>""</commun_address>
                    </contact_data>
                    <contact_data>
                        <commun_method>CMNM0002</commun_method>
                        <commun_address>bnpl_tts@vietcredit.com.vn</commun_address>
                    </contact_data>
                </contact>
                <address>
                    <command>CMMDCRUP</command>
                    <address_type>ADTPHOME</address_type>
                    <country>704</country>
                    <address_name language="LANGVNM">
                        <region>..</region>
                        <city>Hà Nội</city>
                        <street>CITYHOUSE - CITY OASIS, 42/4 HỒ HẢO HỚN, CÔ GIANG,</street>
                    </address_name>
                    <postal_code>100000</postal_code>
                    <region_code>HNOI</region_code>
                </address>
                <address>
                    <command>CMMDCRUP</command>
                    <address_type>ADTPLGLA</address_type>
                    <country>704</country>
                    <address_name language="LANGVNM">
                        <region>Đan Phượng</region>
                        <city>Hà Nội</city>
                        <street>, XÃ LIÊN HÀ</street>
                    </address_name>
                    <postal_code>100000</postal_code>
                    <region_code>HNOI</region_code>
                </address>
                <address>
                    <command>CMMDCRUP</command>
                    <address_type>ADTPBSNA</address_type>
                    <country>704</country>
                    <address_name language="LANGVNM">
                        <region>..</region>
                        <city>..</city>
                        <street>..</street>
                    </address_name>
                    <postal_code>....</postal_code>
                    <region_code>....</region_code>
                </address>
            </customer>
        </application>
    </S:Body>
</S:Envelope>